app/Controllers/Dashboard.php

    public function users()
    {
        $perPage = 20;
        if (isset($_GET['count'])) {
            $perPage = $_GET['count'];
        }
        $pager = service('pager');
        $page = (@$_GET['page']) ? $_GET['page'] : 1;
        $offset = ($page - 1) * $perPage;
        if (isset($_GET['column'])) {
            $data['users'] = $this->db->table('user')->orderBy($_GET['column'], 'ASC')->get($perPage, $offset)->getResultArray();
        } else {
            $data['users'] = $this->db->table('user')->get($perPage, $offset)->getResultArray();
        }

        $i = 0;
        foreach ($data['users'] as $row) {
            $deposit_total = $this->db->table('deposit')->select('SUM(depo_user_amount) as total_deposit')->where('depo_user_id', $row['user_id'])->get()->getResultArray();
            $total_withdraw = $this->db->table('withdraw')->select('SUM(with_user_amount) as total_withdraw')->where('with_user_id', $row['user_id'])->get()->getResultArray();
---
SELECT *
FROM `user`
ORDER BY `created_at` ASC
 LIMIT 20
SELECT SUM(depo_user_amount) as total_deposit
FROM `deposit`
WHERE `depo_user_id` = '1'
SELECT SUM(with_user_amount) as total_withdraw
FROM `withdraw`
WHERE `with_user_id` = '1'

            }
            $i++;
        }
        $data['total'] = $this->db->table('user')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user`

    public function withdraw()
    {
        $perPage = 20;
        if (isset($_GET['count'])) {
            $perPage = $_GET['count'];
        }
        $pager = service('pager');
        $page = (@$_GET['page']) ? $_GET['page'] : 1;
        $offset = ($page - 1) * $perPage;
        if (isset($_GET['column'])) {
            $data['withdraw'] = $this->db->table('withdraw')->select('with_user_id,id,with_status,user_name,with_user_amount,withdraw.created_at')->join('user', 'user.user_id = withdraw.with_user_id')->orderBy($_GET['column'], 'ASC')->get($perPage, $offset)->getResultArray();
        } else {
            $data['withdraw'] = $this->db->table('withdraw')->select('with_user_id,id,with_status,user_name,with_user_amount,withdraw.created_at')->join('user', 'user.user_id = withdraw.with_user_id')->get($perPage, $offset)->getResultArray();
        }
        $data['total'] = $this->db->table('withdraw')->countAllResults();
---
SELECT `with_user_id`, `id`, `with_status`, `user_name`, `with_user_amount`, `withdraw`.`created_at`
FROM `withdraw`
JOIN `user` ON `user`.`user_id` = `withdraw`.`with_user_id`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `withdraw`

    public function msgs()
    {
        $perPage = 20;
        if (isset($_GET['count'])) {
            $perPage = $_GET['count'];
        }
        $pager = service('pager');
        $page = (@$_GET['page']) ? $_GET['page'] : 1;
        $offset = ($page - 1) * $perPage;
        if (isset($_GET['column'])) {
            $data['messages'] = $this->db->table('messages')->where('replied','0')->where('msg_from','USER')->select('messages.id,user_name,msg_user_id,msg,messages.created_at')->join('user', 'user.user_id = messages.msg_user_id')->orderBy($_GET['column'], 'ASC')->get($perPage, $offset)->getResultArray();
        } else {
            $data['messages'] = $this->db->table('messages')->where('replied','0')->where('msg_from','USER')->select('messages.id,user_name,msg_user_id,msg,messages.created_at')->join('user', 'user.user_id = messages.msg_user_id')->get($perPage, $offset)->getResultArray();
        }
        $data['total'] = $this->db->table('messages')->countAllResults();
---
SELECT `messages`.`id`, `user_name`, `msg_user_id`, `msg`, `messages`.`created_at`
FROM `messages`
JOIN `user` ON `user`.`user_id` = `messages`.`msg_user_id`
WHERE `replied` = '0'
AND `msg_from` = 'USER'
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `messages`

    public function withdraw_status()
    {
        $data = array(
            'with_status' => $_POST['status']
        );

        if($_POST['status'] == 'COMPLETED'){
            $msg = 'Your withdrawal is completed';
        }else{
            $msg = 'Your withdrawal is rejected';
        }

        $data2 = array(
            'msg_from' => 'ADMIN',
            'msg_user_id' => $_POST['userid'],
            'msg' => $msg,
        );

        $this->db->table('messages')->set($data2)->insert();

        if ($this->db->table('withdraw')->set($data)->where('id', $_POST['id'])->update()) {
---
INSERT INTO `messages` (`msg_from`, `msg_user_id`, `msg`) VALUES ('ADMIN', '1', 'Your withdrawal is completed')
UPDATE `withdraw` SET `with_status` = 'COMPLETED'
WHERE `id` = '17'