app/Controllers/Game.php

    public function bet()
    {
        //check if amount is greater than user alance
        $userid = $this->session->get('user_id');

        //check user
        if (!isset($userid) && empty($userid)) {
            $json['result'] = 500;
            return $this->response->setJSON($json);
        }

        //check balance
        $betamount = $_POST['amount'];
        $user_balance = $this->db->table('coin')->where('user_id', $userid)->get()->getResultArray();
---
SELECT *
FROM `coin`
WHERE `user_id` = '1'

            'user_id' => $userid,
        );

        if ($this->db->table('bets')->insert($arr)) {
---
INSERT INTO `bets` (`betoption`, `amount`, `time`, `user_id`) VALUES ('EVEN', '44', '00', '1')

        $updated_user_balance = $user_balance[0]['coins'] - $betamount;
        $updated_balance['coins'] = $updated_user_balance;

        if ($this->db->table('coin')->set($updated_balance)->where('user_id', $userid)->update()) {
---
UPDATE `coin` SET `coins` = 952
WHERE `user_id` = '1'

    public function withdraw()
    {
        $withdraw_amt = $_POST['amount'];
        $userid = $this->session->get('user_id');
        if (!isset($userid) && empty($userid)) {
            $json['result'] = 500;
            return $this->response->setJSON($json);
        }

        if ($withdraw_amt < 1000) {
            $json['result'] = 300;
            return $this->response->setJSON($json);
        }

        $user_balance = $this->db->table('coin')->where('user_id', $userid)->get()->getResultArray();
        $user_info = $this->db->table('user')->where('user_id', $userid)->get()->getResultArray();
---
SELECT *
FROM `coin`
WHERE `user_id` = '1'
SELECT *
FROM `user`
WHERE `user_id` = '1'

            $updated_user_balance = $user_balance[0]['coins'] - $withdraw_amt;
            $updated_balance['coins'] = $updated_user_balance;

            if ($this->db->table('coin')->set($updated_balance)->where('user_id', $userid)->update()) {
---
SELECT *
FROM `coin`
WHERE `user_id` = '1'

    public function user_send_msg(){
        $msg = $_POST['msg'];
        $data = array(
            'msg_from' => 'USER',
            'msg_user_id' => $this->session->get('user_id'),
            'msg' => $msg,
        );
        if ($this->db->table('messages')->insert($data)) {
---
INSERT INTO `messages` (`msg_from`, `msg_user_id`, `msg`) VALUES ('USER', '1', 'ewew')