app/Controllers/Game.php

INSERT INTO `deposit` (`depo_user_id`, `depo_user_amount`, `depo_transaction_id`) VALUES ('1', '100', 'pay_MiFChaKf0PPFio')
UPDATE `coin` SET `coins` = 300
WHERE `user_id` = '1'
---
    public function update_user_balance()
    {
        // echo'<pre>';print_r($_POST);exit;
        $amount = $_POST['amount'];
        $payment_id = $_POST['payment_id'];
        $userid = $this->session->get('user_id');
        $first_deposit = 0;

        $array = array(
            'depo_user_id' => $userid ,
            'depo_user_amount' => $amount,
            'depo_transaction_id' => $payment_id
        );

        $this->db->table('deposit')->insert($array);

        $user_balance = $this->db->table('coin')->where('user_id', $userid)->get()->getResultArray();
        $json['result'] = 400;

        if (isset($user_balance) && !empty($user_balance)) {
            //debit amount from user
            if($user_balance[0]['first_deposit'] == '1'){
                $first_deposit = 300;
            }

            $updated_user_balance = $user_balance[0]['coins'] + number_format($amount) + number_format($first_deposit);
            $updated_balance['coins'] = $updated_user_balance;
            $updated_balance['coins'] = $updated_user_balance;
            $updated_balance['first_deposit'] = 0;

            if ($this->db->table('coin')->set($updated_balance)->where('user_id', $userid)->update()) {