app/Controllers/Home.php

    public function view()
    {
        $userid = $this->session->get('user_id');
        $data['last_roll'] = $this->db->table('rolls')->select('dice1,dice2,total')->orderBy('id','desc')->limit(1)->get()->getResultArray();
        $data['first_deposit'] = $this->db->table('coin')->select('first_deposit')->where('user_id',$userid)->limit(1)->get()->getResultArray();
        $data['user_info'] = $this->db->table('user')->select('*')->where('user_id',$userid)->limit(1)->get()->getResultArray();
        $data['user_bet_history'] = $this->db->table('bets')->select('*')->where('user_id',$userid)->orderBy('id','desc')->limit(100)->get()->getResultArray();
        $data['previous_activity'] = $this->db->table('rolls')->select('*')->orderBy('id','desc')->limit(100)->get()->getResultArray();
        $data['transactions_deposit'] = $this->db->table('deposit')->select('*')->where('depo_user_id',$userid)->orderBy('created_at','desc')->limit(100)->get()->getResultArray();
        $data['transactions_withdraw'] = $this->db->table('withdraw')->select('*')->where('with_user_id',$userid)->orderBy('created_at','desc')->limit(100)->get()->getResultArray();
---
SELECT `dice1`, `dice2`, `total`
FROM `rolls`
ORDER BY `id` DESC
 LIMIT 1
SELECT `first_deposit`
FROM `coin`
WHERE `user_id` IS NULL
 LIMIT 1
SELECT *
FROM `user`
WHERE `user_id` IS NULL
 LIMIT 1
SELECT *
FROM `bets`
WHERE `user_id` IS NULL
ORDER BY `id` DESC
 LIMIT 100
SELECT *
FROM `rolls`
ORDER BY `id` DESC
 LIMIT 100
SELECT *
FROM `deposit`
WHERE `depo_user_id` IS NULL
ORDER BY `created_at` DESC
 LIMIT 100
SELECT *
FROM `withdraw`
WHERE `with_user_id` IS NULL
ORDER BY `created_at` DESC
 LIMIT 100