app/Controllers/Login.php

UPDATE `user` SET `lastlogin` = '2023-10-10 18:36:52'
WHERE `user_email` = 'ronymehta321@gmail.com'
---
    public function Auth(){
        $pass = md5($_POST['password']);
        $data = array(
            'user_email' => $_POST['email'],
            'user_password' => $pass,
        );

        $time = array(
            'lastlogin'=> date('Y-m-d H:i:s')
        );
        $count = $this->db->table('user')->where($data)->countAllResults();

        if($count == 0){
            $result['result'] = '400';
        }else{
            $result['result'] = '200';
            $user = $this->db->table('user')->where($data)->get()->getResultArray();
            $this->session->set('username',$user[0]['user_name']);
            $this->session->set('user_id',$user[0]['user_id']);
            if($user[0]['user_role']){
                $this->session->set('role','Admin');
            }else{
                $this->session->set('role','User');
            }
            $this->db->table('user')->set($time)->where('user_email',$_POST['email'])->update();