app/Views/index.php

SELECT *
FROM `coin`
WHERE `user_id` = '1'
---
$coins = '';
if (isset($user_id) && !empty($user_id)) {
    $db = db_connect();
    $coins = $db->table('coin')->where('user_id', $user_id)->get()->getResultArray();